# Rpstr_GetValueReal

## Description
Get a real value from the VectorScript value repository.

```pascal
FUNCTION Rpstr_GetValueReal(
				name         : STRING;
				defaultValue : REAL) : REAL;
```

```python

def vs.Rpstr_GetValueReal(name, defaultValue):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|The name of the value.|
|defaultValue|REAL|Default value if the name does not exist in the VectorScript value repository.|

## See Also
VS Functions:
Rpstr_RemoveValues| Rpstr_RemoveValue| Rpstr_GetValueBool| Rpstr_SetValueBool| Rpstr_GetValueInt| Rpstr_SetValueInt| Rpstr_GetValueReal| Rpstr_SetValueReal| Rpstr_GetValueStr| Rpstr_SetValueStr

## Version
Availability: from Vectorworks 2012
## Category
* Utility